randread/64_node/job_1470977_fiojob_2/nid00149_fiojob_2/output.log
test: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=256
...
fio-3.27
Starting 2 processes
rand-read: Laying out IO file (1 file / 1024MiB)

test: (groupid=0, jobs=2): err= 0: pid=154681: Mon Jul 19 19:33:08 2021
  read: IOPS=169, BW=679KiB/s (696kB/s)(199MiB/300004msec)
    slat (usec): min=456, max=155010, avg=11756.58, stdev=11223.98
    clat (usec): min=17, max=6710.7k, avg=2975334.90, stdev=1745469.09
     lat (msec): min=4, max=6728, avg=2987.09, stdev=1752.25
    clat percentiles (msec):
     |  1.00th=[ 1452],  5.00th=[ 1569], 10.00th=[ 1687], 20.00th=[ 1821],
     | 30.00th=[ 1871], 40.00th=[ 1921], 50.00th=[ 1989], 60.00th=[ 2072],
     | 70.00th=[ 2299], 80.00th=[ 5336], 90.00th=[ 6074], 95.00th=[ 6275],
     | 99.00th=[ 6477], 99.50th=[ 6544], 99.90th=[ 6611], 99.95th=[ 6678],
     | 99.99th=[ 6678]
   bw (  KiB/s): min=  112, max= 1498, per=100.00%, avg=684.43, stdev=185.88, samples=1177
   iops        : min=   28, max=  374, avg=171.06, stdev=46.44, samples=1177
  lat (usec)   : 20=0.01%, 50=0.01%
  lat (msec)   : 10=0.01%, 20=0.01%, 50=0.01%, 100=0.03%, 250=0.06%
  lat (msec)   : 500=0.13%, 750=0.13%, 1000=0.10%, 2000=51.95%, >=2000=47.58%
  cpu          : usr=0.19%, sys=1.30%, ctx=50969, majf=0, minf=590
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=99.8%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.1%
     issued rwts: total=50946,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=256

Run status group 0 (all jobs):
   READ: bw=679KiB/s (696kB/s), 679KiB/s-679KiB/s (696kB/s-696kB/s), io=199MiB (209MB), run=300004-300004msec